brew "alacritty"
brew "aspell"
brew "bat"
brew "biome"
brew "clang-format"
brew "cmigemo"
brew "direnv"
brew "emacs"
brew "fd"
brew "fish"
brew "fisher"
brew "font-dejavu-sans-mono-for-powerline "
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "gibo"
brew "hstr"
brew "jq"
brew "ni"
brew "plantuml"
brew "pnpm"
brew "ranger"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "tmux"
brew "tpm"
brew "trash-cli"
brew "uv"
brew "zoxide"

# cask
cask "alacritty"
cask "antigravity"
cask "codex"
cask "figma"
cask "font-google-sans-code"
cask "font-noto-sans-mono-cjk-jp"
cask "obsidian"
cask "visual-studio-code"
cask "vlc"

# macOS
if OS.mac?
  # brew
  brew "cocoapods"
  brew "yt-dlp"
  brew "mpv"
  brew "battery"

  # cask
  cask "dropbox"
  cask "google-chrome"
  cask "google-japanese-ime"
  cask "bettertouchtool"
  cask "numi"
  cask "protonvpn"
  cask "raycast"
  cask "rectangle"
  cask "scroll-reverser"
  cask "signal"
  cask "skim"
  cask "smoothcsv"

  # mas
  brew "mas"
  mas "Amphetamine", id: 937984704
  mas "Developer", id: 640199958
  mas "Tailscale", id: 1475387142
  mas "Windows App", id: 1295203466
end
